/** @jsxImportSource @emotion/react */
import React from 'react'
import Page from 'components/Page'
import { css } from '@emotion/react'
import { theme } from '../../theme'

const styles = {
  root: css({
    minWidth: 275,
    padding: theme.spacing(4),
    marginTop: theme.spacing(3),
  }),
  card: css({
    minWidth: 275,
    padding: theme.spacing(4),
    marginTop: theme.spacing(3),
  }),
  field: css({
    width: '100%',
    marginBottom: theme.spacing(2),
  }),
}

function Reservation({ match, location }) {

  return (
    <Page css={styles.root} title="立即登入查看我的東森幣">
      <div>
        <p>
          <strong>名留集團隱私權保護政策</strong>
          <br />
          名留集團（包含PS、AT、上越、名留，下稱本平台）為名留國際股份有限公司，為了提供您一個可以放心的全通路購物環境，以及對您隱私權的重視，因此制訂了隱私權保護政策。隱私權保護政策內容，包括我們如何處理因您使用本平台服務時蒐集到的個人資料、購物時的交易資料等。隱私權保護政策適用於名留國際股份有限公司。祝
          購物愉快。
        </p>
        <p>
          <strong>個人資料的取得</strong>
          <br />
          1. 當您透過全通路管道註冊成為本平台會員時，我們會蒐集您的：
          <br />
          1.1 姓名（必須提供）
          <br />
          1.2 手機號碼（必須提供）
          <br />
          1.3 設定密碼（必須提供）
          <br />
          1.4 電子郵件地址（非必須提供）
          <br />
          1.5 國籍（非必須提供）
          <br />
          1.6 語系及第二外語（非必須提供）
          <br />
          1.7 您主動或願意提供的身分證字號、出生日期等其他資料（非必須提供）
          <br />
          2. 當您成為本平台會員並進行購物時，蒐集您的帳務、交易記錄及可能蒐集您的信用卡資料。
          <br />
          3.
          蒐集以上資料是為了完成訂購交易、商品配送、會員管理與服務、行銷資訊通知、市場分析及其他合於營業登記項目或章程所定業務之需要（詳細請參閱下揭個人資料權益宣告），並且在您往後購物時自動帶出您的個人資料，以節省重複填寫資料的時間。
          <br />
          4.
          當您另為指定向第三方進行商品配送服務時，我們會蒐集收件人的姓名、聯絡電話、配送地址及其他配送必要資料，以便順利完成您所指定的配送服務。
        </p>
        <p>
          <br />
          <strong>個人資料的運用</strong>
          <br />
          您在本平台註冊的資料，僅供本平台於營業期間（或特定目的利用之適當期間）及特定目的利用範圍內，為向您提供相關服務（詳細請參閱下揭個資權益宣告）之使用，除依據相關的法律規定外，我們不會將您的資料提供給未經您同意的任何第三方、或移作其他目的使用。
        </p>
        <p>
          <strong>個人資料提供予第三方的例外</strong>
          <br />
          在以下情況，本平台得依法將您的個人資料提供予第三方之政府機關、其他人士或公司：
          <br />
          1. 提供資料前已取得您的同意。
          <br />
          2.
          為完成您要求的購物服務、會員活動（含APP遊戲、抽獎活動等）之必要，依據本平台與第三方間契約關係，將於必要範圍內提供個人資料給其他人士或公司。
          <br />
          3. 因法律規定或司法、檢警及其他公務機關行使法定權利而要求提供。
        </p>
        <p>
          <br />
          <strong>個人資料之修改</strong>
          <br />
          當您發現個人資料不正確或者個人資料有變更的時候，您可以隨時利用您的 ID 和密碼在&nbsp;
          <a
            className="c-link"
            href="http://www.mlgroup.io/"
            target="_blank"
            rel="noopener noreferrer"
            data-stringify-link="http://www.mlgroup.io"
            data-sk="tooltip_parent"
          >
            www.mlgroup.io
          </a>
          &nbsp;網站上更改您所輸入的個人資料（姓名、住址、電話、電子信箱等），或透過客服專線
          02-2522-3393
          由專人協助您更改個人資料。但歷史的服務內容紀錄、收件人資料、付款資料等不在此更改範圍內。
        </p>
        <p>
          <strong>IP Address 及 Cookie</strong>
          <br />
          名留集團網站及手機購物 APP 會自動接收並紀錄您於瀏覽器上的伺服器數值，包括互聯網協定位址 (
          IP Address ) 、 Cookie
          中的資料及您要求取用的網頁紀錄。這些資料的使用用途為：改進提供您廣告及網頁內容、完成您對某項商品的要求及通知您特別活動或新商品等。
        </p>
        <p>
          <strong>資料安全</strong>
          <br />
          我們公司之資料庫設有防火牆、防毒等各種資訊安全措施以保護您的個人資料安全，包括作業程序面、技術面、名留集團人員教育訓練及國際資訊安全認證
          ISO 27001。
        </p>
        <p>
          <strong>個資權益宣告</strong>
          <br />
          依中華民國個人資料保護法第 8 條規定，向當事人蒐集個人資料時，應明確告知以下事項：
          <br />
          1. 資料之蒐集：
          <br />
          名留國際股份有限公司將依照您主動提供（包含您同意提供或基於契約關係、類似契約關係者），或經您同意由第三方提供等其他合法方式蒐集有關您的個人資料；若您的個人資料係自第三方取得，名留國際股份有限公司將於首次利用時，告知您資料來源及對您進行隱私聲明。
          <br />
          2. 蒐集之目的：
          <br />
          依中華民國個人資料保護法第 8 條規定，向當事人蒐集個人資料時，應明確告知以下事項：
          <br />o
          商品配送：為完成商品銷售及訂購，進行物流寄送之履行訂單服務，可能提供關於您的必要配送資料予供貨廠商或物流廠商。
          <br />o
          交易授權：為完成訂購之交易，於金融交易過程（信用卡授權）中，將提供您的帳務資料予金融機構，進而取得授權碼及完成請款。
          <br />o
          市場分析：為開發及提供更優化的客戶服務，會依據您的交易記錄、關注商品記錄、基本資料等，進行市場分析。
          <br />o
          行銷通知：為提供您更多優質商品及優惠、活動資訊，在您同意下，將透過您的基本資料（電話、電子信箱地址、聯絡地址）向您通知相關訊息。
          <br />o
          會員管理與服務：基於本平台服務目的，有效進行相關會員活動與會員服務（如商品諮詢、售後服務廠商聯繫、權益通知等），將使用您的基本資料與交易、客服記錄。
          <br />
          另外，依中華民國法務部公布之「個人資料保護法之特定目的及個人資料之類別」，名留國際股份有限公司蒐集、處理、利用您的個人資料特定目的如下：
          <br />
          040 行銷
          <br />
          063 非公務機關依法定義務所進行個人資料之蒐集處理及利用
          <br />
          069 契約、類似契約或其他法律關係事務
          <br />
          090 消費者、客戶管理與服務
          <br />
          091 消費者保護
          <br />
          098 商業與技術資訊
          <br />
          107 供應管理
          <br />
          111 票券業務
          <br />
          129 會計與相關服務
          <br />
          136 資(通)訊與資料庫管理
          <br />
          148 網路購物及其他電子商務服務
          <br />
          152 廣告或商業行為管理
          <br />
          157 調查、統計與研究分析
          <br />
          181 其他經營合於營業登記項目或組織章程所定之業務
          <br />
          3. 蒐集之個人資料類別：
          <br />o 必須提供的基本資料：姓名、手機號碼、設定密碼等
          <br />o
          非必須提供的基本資料：電子郵件地址、國籍、語系及第二外語、身分證字號、出生日期等其他資料。
          <br />o 配送資料：收件人姓名、配送地址、聯絡電話及其他配送必要資料。
          <br />o 帳務資料：金融機構帳號與戶名、信用卡卡號、信用卡有效期限等完成金融交易必要資料。
          <br />o 其他資料：交易記錄、客服記錄、IP Address、Cookie等。
          <br />
          另外，依中華民國法務部公布之「個人資料保護法之特定目的及個人資料之類別」，名留國際股份有限公司蒐集、處理、利用您的個人資料類別如下：Ｃ○○一
          辨識個人者：姓名、地址、電話號碼、手機號碼、臉書平臺帳號、電子郵件地址等。
          <br />
          Ｃ○○二 辨識財務者：金融機構帳號與戶名、信用卡號碼、信用卡有效期限等。
          <br />
          Ｃ○○三 政府資料中之辨識者：例如身分證統一編號、居留證號碼等。
          <br />
          Ｃ○一一 個人描述：出生日期、出生地、性別、聲音等。
          <br />
          Ｃ○三一 住家地址。
          <br />
          Ｃ○三六 生活格調：消費商品及服務之種類、個人消費模式等。
          <br />
          Ｃ○七三 安全細節：密碼。
          <br />
          Ｃ○九三 財務交易：收付金額、支付方式、往來紀錄等。
          <br />
          Ｃ一○二 約定或契約：關於交易、商業、法律或其他契約、代理等。
          <br />
          Ｃ一三二 未分類之資料：客戶服務記錄。
          <br />
          4.個人資料利用之期間、地區、對象及方式：
          <br />
          名留國際股份有限公司為提供會員服務（包括但不限於交易之查詢、退換貨及售後服務等）將於營運期間（或特定目的範圍之適當期間）、於中華民國境內共同蒐集、處理、利用會員個人資料，且為基於服務目的，名留國際股份有限公司會委任處理營運相關事務之必要第三方（如：合作供貨廠商、物流廠商）或由名留國際股份有限公司基於寄發行銷優惠訊息目的，均將使用您的個人資料；惟當會員要求刪除個人資料時，名留國際股份有限公司將先凍結該會員資料與其歷史訂單記錄，並禁止員工對該會員的資料進行因行銷目的之處理、利用，除法令訂有應保存期間的特定資料外，於適當期間內立即完成刪除或去識別化。為使名留國際股份有限公司所屬會員均能充分享有名留集團優惠權益，原蒐集、處理之個人資料得自2019年7月1日起共同利用。
          <br />
          5.您可以向名留國際股份有限公司就您的個人資料行使以下權利：
          <br />
          5.1 查詢或請求閱覽
          <br />
          5.2 請求製給複製本
          <br />
          5.3 請求補充或更正
          <br />
          5.4 請求停止蒐集、處理或利用
          <br />
          5.5 請求刪除
          <br />
          但查詢或請求閱覽個人資料或製給複製本者，名留國際股份有限公司得酌收必要成本費用每件 NT
          60元。
          <br />
          6.您可以自由選擇提供您之個人資料予名留國際股份有限公司，若您選擇不提供必要的個人資料（姓名、手機號碼），將無法成為我們的會員；若您選擇不提供其他非必要的個人資料（如身分證字號、出生日期等），可能無法享有相關優惠或接收優惠通知（如生日優惠活動）。
          <br />
          7.若您欲行使本宣告第5點的權利，或日後欲取消接受本平台所提供的任何或特定行銷活動訊息，可以撥打本平台之客服專線
          02-2522-3393，由專人協助您辦理。
        </p>
        <p>
          <strong>隱私聲明的修正權利</strong>
          <br />
          1.
          針對上揭聲明內容，本平台將因應科技發展趨勢、相關法規修訂或其他環境變遷等因素，視情況進行適當之修改，以落實保障使用者隱私權的立意。
          <br />
          2.
          本平台修改隱私聲明時，將以電子郵件、電話、簡訊、通信網路、網路公告、型錄公告或其他適當方式通知您，當您繼續使用本平台所提供之服務時，即表示您已閱讀、明瞭且同意接受隱私聲明內容的所有變更內容。
        </p>
        <p>109年12月8日修訂版</p>
      </div>
    </Page>
  )
}

export default React.memo(Reservation)
